# ElementTypeParameterized Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..ElementTypeParameterized Property
BuiltInFailures..::..FamilyFailures Class See Also
---
The type(s) of the selected element(s) are driven by family parameter(s). Changing the type directly will break the association.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementTypeParameterized { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementTypeParameterized As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementTypeParameterized {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace